namespace WorkOutWebHookBot.BotStrings.Answers
{
    public static class BaseAnswers
    {
        public static string ZeroPartners = "Пока что партнеров нет";

        public static string StartString = "Привет! 👋🏻\r\nЕсли у Вас есть интересная новость, то поспешите этой новостью поделиться с нами! Не скупитесь на фото или видео. 📸 \r\nЕсли Ваша новость о каком-то событии, то обязательно укажите место и время его проведения. 🤗";

        public static string SuccessToSendNews = "Вы успешно отправили свою новость";
        public static string Error = "Что-то пошло не так";
        public static string UnknownCommand = "Извините я не знаю такой команды";
        public static string AboutAirPower = "Общероссийская физкультурно-спортивная общественная организация \"Федерация воздушно-силовой атлетики России\" https://vk.com/rapaf. www.rapaf.ru Воздушно-силовая атлетика – официальный неолимпиийскии‌ вид спорта, в состав которого входят группы дисциплин «Воркаут». \r\nТакое название вид спорта получил из-за специфики сложно-технических элементов (далее- СТЭ), во время выполнения которых спортсмен преимущественно находится в воздухе. \r\nВ декабре 2018 года «воздушно-силовая атлетика» (далее – ВСА) официально была признана видом спорта в России.\r\nСоревнования по «воздушно-силовой атлетике» проводятся по системе непосредственного определения мест спортсменов путем ранжирования результатов, при которой результаты соревнующихся спортсменов оцениваются суммой баллов.\r\nГруппы дисциплин,развиваемые ОФСОО \"ФВСАР\": \"воркаут фристайл\", \"скоростно -силовое многоборье\".\r\n\r\nОфициальные спортивные соревнования проводятся по спортивным дисциплинам в соответствии с Всероссийским реестром видов спорта:\r\n-Воркаут фристайл;\r\n-Воркаут фристайл — пара;\r\n-Воркаут фристайл — пара смешанная;\r\n-Воркаут фристайл — группа;\r\n-Воркаут фристайл — группа смешанная.\r\n\r\nВоркаут (англ. «street workout») – физкультурно-спортивное направление, которое заключается в выполнении упражнений с использованием спортивных снарядов (турники, брусья, шведские стенки, горизонтальные лестницы и прочие конструкции) или без их использования.\r\nОсновной упор при проведении тренировок и соревнований делается на работу с собственным весом. Данная спортивная активность способствует пропорциональному развитию силы, выносливости и гибкости всего тела.\r\nВ России воркаут развивается как субкультура «street workout» и спортивное направление «воздушно-силовая атлетика» с группами дисциплин: «воркаут».";

        public static string IncorrectUpdateType = "Пожалуйста подождите новость обрабатывается";

        public static string TooManyMediaGroupItems = "Отправили с новостью только 10 первых файлов.\n Максимум файлов для отправки в одном сообщении - 10";

        public static string ProcessNews = "Обрабатываем вашу новость";
        public static string AboutStudAirPower = "Общероссийская общественная организация \"Национальная студенческая лига воздушно-силовой атлетики\" (\"НСЛВСА\") vk.com/nslvsa www.nslvsa.ru - это сообщество спортсменов-студентов, университетских студенческих спортивных клубов и вузов,\r\nкультивирующих воздушно-силовую атлетику. создана для гармоничного взаимодействия с ВУЗами и\r\nССУЗами России, а также для развития проекта «Прорыв к Здоровью».\r\n\r\nДата создания НСЛВСА: 31 марта 2021 г.\r\n\r\nУчредители НСЛВСА: https://vk.com/rapaf ОФСОО \"Федерация воздушно-силовой атлетики России\" и \"Российский\r\nстуденческий спортивный союз\".\r\nЦель - комплексное развитие вида спорта воздушно-силовой атлетики, а также содействие в\r\nпопуляризации массового спорта, физической культуры и норм ВФСК «ГТО» посредством\r\nреализации социально-значимых проектов для студентов и молодежи.";
        internal static string TooManyCaptions = "Ошибка, если отправляете много файлов, то оставте подпись только к одному из них";
    }
}
